{
  "HomePage": {
    "presentation": "Web Developer",
    "description": "Welcome! I am a Web Developer with over two years of professional experience collaborating in agile teams. My expertise lies in building dynamic web applications using React and TypeScript, with a strong focus on performance, accessibility, and user experience.",
    "mainSkills": "Main Skills"
  },
  "Portfolio": {
    "projectsTitle": "Projects",
    "experienceTitle": "Professional Experience",
    "newsTitle": "Space News",
    "newsDescription": "A web application that delivers the latest space-related news, built with a Next.js frontend and backend. The app leverages a MongoDB database and utilizes a Vercel cron job to automatically update news content twice a day by consuming the News API.",
    "sttoriaTitle": "Sttoria's Landing Page",
    "SttoriaDescription": "An elegant landing page for Sttoria Photography Studio, featuring a sleek bento-style image gallery to showcase their services and a minimalist video player for a clean, professional presentation.",
    "tasksTitle": "Tasks Manager",
    "taskManagerDescription": "A robust task management application featuring a Kanban board layout that supports CRUD operations, advanced filtering, pagination, and Google authentication for user access.",
    "twilioTitle": "Full Stack Developer at Twilio (2 years)",
    "twilioDescription": "As a consultant, I contributed to the successful migration of a documentation site from Django to Next.js. I developed new React components, adhering to best practices in Test-Driven Development (TDD), SEO optimization, accessibility, responsiveness, and performance. In addition, I led the Quality Assurance (QA) process, ensuring that the newly developed pages functioned correctly and met high standards.",
    "jelouTitle": "Frontend Developer at Jelou (3 months)",
    "jelouDescription": "Implemented support for uploading elements, including PDFs and multimedia, within the HSM (High Structure Message) template input form. Additionally, I integrated the new landing page design into a Next.js framework, ensuring seamless functionality and alignment with the design specifications.",
    "nidoTitle": "Engineer at Nido Interactive (2 years)",
    "nidoDescription": "As an Interactivity Engineer, I specialize in bringing interactive installations to life by programming embedded systems such as Raspberry Pi and Arduino. With expertise in assembling and soldering custom circuits and integrating various sensors, I create dynamic and responsive environments.",
    "viewProject": "View Project",
    "seeDescription": "See description",
    "hideDescription": "Hide description"
  },
  "Navigation": {
    "home": "Home",
    "portfolio": "Portfolio",
    "certifications": "Certifications"
  },
  "LocaleSwitcher": {
    "label": "Change language",
    "locale": "{locale, select, en {🇺🇸 English} es {🇪🇸 Spanish} other {Unknown}}"
  }
}
