{
  "HomePage": {
    "presentation": "Web Developer",
    "knowMore": "Know more...",
    "description": "Welcome! I am a Web Developer with 3 years of professional experience collaborating in agile teams. My expertise lies in building dynamic web applications, with a strong focus on performance, accessibility, and user experience.",
    "mainSkills": "Main Skills",
    "englishProficiency": "C1 English Proficiency",
    "fastLearning": "Fast Learning",
    "problemSolver": "Problem Solver"
  },
  "Portfolio": {
    "projectsTitle": "Projects",
    "experienceTitle": "Professional Experience",
    "newsTitle": "Space News",
    "newsDescription": "A web application that delivers the latest space-related news, built with a Next.js frontend and backend. The app leverages a MongoDB database and utilizes a Vercel cron job to automatically update news content twice a day by consuming the News API.",
    "sttoriaTitle": "Sttoria's Landing Page",
    "SttoriaDescription": "An elegant landing page for Sttoria Photography Studio, featuring a sleek bento-style image gallery to showcase their services and a minimalist video player for a clean, professional presentation.",
    "tasksTitle": "Kanban-style Tasks Manager",
    "taskManagerDescription": "A robust task management application featuring a Kanban board layout that supports CRUD operations, advanced filtering, pagination, and Google authentication for user access.",
    "dashboardTitle": "Invoices Dashboard (Migration to Prisma)",
    "dashboardDescription": "As part of a Next.js course, I developed a dashboard that relies on the latest features of Next.js. The initial implementation used the @vercel/postgres library for database queries. However, I challenged myself to go beyond the course material and successfully integrated Prisma (@prisma/client) as a replacement. This migration was an enriching experience in enhancing database management with Prisma's more advanced querying capabilities.",
    "twilioTitle": "Full Stack Developer at Twilio (2 years)",
    "twilioDescription": "As a consultant, I contributed to the successful migration of Twilio's documentation site from Django to Next.js. I developed new React components, adhering to best practices in Test-Driven Development (TDD), SEO optimization, accessibility, responsiveness, and performance. In addition, I led the Quality Assurance (QA) process, ensuring that the newly developed pages functioned correctly and met high standards.",
    "jelouTitle": "Frontend Developer at Jelou (3 months)",
    "jelouDescription": "Implemented support for uploading elements, including PDFs and multimedia, within the HSM (High Structure Message) template input form. Additionally, I integrated the new landing page design into a Next.js framework, ensuring seamless functionality and alignment with the design specifications.",
    "nidoTitle": "Engineer at Nido Interactive (2 years)",
    "nidoDescription": "As an Interactivity Engineer, I specialized in bringing interactive installations to life by programming embedded systems such as Raspberry Pi and Arduino. With expertise in assembling and soldering custom circuits and integrating various sensors, I created dynamic and responsive environments.",
    "outlierTitle": "AI Model Training (Present) - Independent Contractor",
    "outlierDescription": "Currently improving generative AI models using my coding expertise and prompt engineering knowledge to train large language models.",
    "viewProject": "View Project",
    "seeDescription": "See description",
    "hideDescription": "Hide description"
  },
  "AboutMe": {
    "title": "From Acoustic Engineer to Software Developer",
    "journeyDescription": "My journey highlights my ability to adapt and learn quickly. From working as a acoustician to becoming an interactive engineer and now a software developer, I've consistently embraced new challenges and technologies.",
    "firstTitle": "Graduated as an Acoustic Engineer",
    "firstDescription": "Worked on projects like the construction of music schools and studios, including the Berklee Music Lab School in Quito, Ecuador.",
    "firstImageDescription": "Music Lab School studio I helped build.",
    "secondTitle": "Entered the Tech World",
    "secondDescription": "Hired to participate in the construction of the Zoom exhibition at the Yaku Water Museum in Ecuador. Designed special speakers and programmed an interactive system using Raspberry Pi.",
    "secondImageDescription": "Museum exhibition for which I designed the dome-type speakers and programmed the interactivity.",
    "thirdTitle": "Interactive Systems Developer",
    "thirdDescription": "Developed interactive systems for museums using Raspberries and Arduinos. My passion for technology and programming began.",
    "thirdImageDescription": "Touch projector that I installed at the 'Intangibles' exhibition by Fundación Teléfonica in Quito, Ecuador.",
    "fourthTitle": "Transition to Web Development",
    "fourthDescription": "During the pandemic, decided to pivot to web development. Attended an intensive 4-month Full Stack course (MERN) where I developed a strong programming foundation that I have continued to hone ever since.",
    "fourthImageDescription": "The first of all my certifications in web development.",
    "fifthTitle": "Frontend Developer at Jelou",
    "fifthDescription": "A month after finishing the course, I was hired as a Frontend developer at Jelou. Web Development journey began in earnest.",
    "fifthImageDescription": "My first professional experience as a Frontend Developer.",
    "sixthTitle": "Full Stack Developer at Twilio",
    "sixthDescription": "After three months at Jelou, I was hired as a remote Full Stack Developer to work on the Twilio Website, as a Stackbuilders contractor.",
    "sixthImageDescription": "I helped build the new documentation site, that contains complex components like Dynamic Code Samples."
  },

  "Navigation": {
    "home": "Home",
    "portfolio": "Portfolio",
    "aboutMe": "About Me"
  },
  "LocaleSwitcher": {
    "label": "Change language",
    "locale": "{locale, select, en {🇺🇸 English} es {🇪🇸 Spanish} other {Unknown}}"
  }
}
