{
  "HomePage": {
    "presentation": "Desarrollador Frontend",
    "knowMore": "Conocer más...",
    "description": "¡Bienvenidos! Cuento con tres años de experiencia profesional colaborando en equipos ágiles. Mi experiencia se centra en la creación de aplicaciones web dinámicas con un enfoque en el rendimiento, la accesibilidad y la experiencia del usuario.",
    "mainSkills": "Habilidades principales",
    "englishProficiency": "Inglés Avanzado: C1",
    "fastLearning": "Rápido Aprendizaje",
    "problemSolver": "Solucionador de Problemas"
  },
  "Portfolio": {
    "projectsTitle": "Proyectos",
    "experienceTitle": "Experiencia Profesional",
    "newsTitle": "Noticias del Espacio",
    "newsDescription": "Una aplicación web que ofrece las últimas noticias relacionadas con el espacio, creada con un frontend y backend de Next.js. La aplicación aprovecha una base de datos MongoDB y utiliza un cron job de Vercel para actualizar automáticamente el contenido de las noticias dos veces al día mediante el uso de la API de noticias.",
    "sttoriaTitle": "Landing Page de Sttoria",
    "SttoriaDescription": "Elegante landing page para el Estudio de Fotografía Sttoria, con una galería de imágenes estilo bento para mostrar sus servicios y un reproductor de video minimalista para una presentación limpia y profesional.",
    "flightsTitle": "Flights app",
    "flightsDescription": "Esta aplicación de búsqueda de vuelos simplifica la búsqueda de vuelos entre aeropuertos mediante la API Sky-Scrapper. Creada con React y diseñada con Material UI, cuenta con validación de entradas, debouncing en los inputs y un diseño responsivo.",
    "tasksTitle": "Administrador de Tareas Estilo Kanban",
    "taskManagerDescription": "Una robusta aplicación de gestión de tareas que cuenta con un diseño de tablero Kanban que admite operaciones CRUD, filtrado avanzado, paginación y autenticación de Google para el acceso de los usuarios.",
    "dashboardTitle": "Dashboard de Facturas (Migración a Prisma)",
    "dashboardDescription": "Como parte de un curso de Next.js, desarrollé un panel de control que se basa en las últimas características de Next.js. La implementación inicial utilizó la biblioteca @vercel/postgres para consultas de bases de datos. Sin embargo, me propuse ir más allá del material del curso e integré con éxito Prisma (@prisma/client) como reemplazo. Esta migración fue una experiencia enriquecedora para mejorar la gestión de bases de datos con las capacidades de consulta más avanzadas de Prisma.",
    "twilioTitle": "Desarrollador Full Stack en Twilio (2 años)",
    "twilioDescription": "Como consultor, contribuí a la migración exitosa del sitio de documentación de Django a Next.js. Desarrollé nuevos componentes de React, siguiendo las mejores prácticas en desarrollo basado en pruebas (TDD), optimización SEO, accesibilidad y rendimiento. Además, dirigí el proceso de control de calidad (QA), asegurándome de que las páginas recién desarrolladas funcionaran correctamente y cumplieran con altos estándares.",
    "jelouTitle": "Desarrollador Frontend en Jelou (2 meses)",
    "jelouDescription": "Implementé soporte para cargar elementos, incluidos archivos PDF y multimedia, dentro del formulario de entrada de plantilla HSM (mensaje de alta estructura). Además, integré el nuevo diseño de la landing page en Next.js, lo que garantizó la correcta funcionalidad y la alineación con las especificaciones de diseño.",
    "nidoTitle": "Ingeniero en Nido Interactive (2 años)",
    "nidoDescription": "Como ingeniero de interactividad, me encargué en dar vida a instalaciones interactivas mediante la programación de sistemas integrados como Raspberry Pi y Arduino. Con experiencia en el montaje y soldadura de circuitos personalizados y la integración de diversos sensores, creo entornos dinámicos y receptivos.",
    "outlierTitle": "Entrenamiento de Modelos de IA (Actualidad) - Consultor Independiente",
    "outlierDescription": "Actualmente estoy mejorando modelos de IA generativos utilizando mi experiencia en codificación y mi conocimiento de prompt engineering para entrenar modelos de lenguaje grandes LLMs.",
    "viewProject": "Ver proyecto",
    "seeDescription": "Mostrar descripción",
    "hideDescription": "Ocultar descripción"
  },
  "AboutMe": {
    "title": "De Ingeniero Acústico a Desarrollador de Software",
    "journeyDescription": "Mi trayectoria profesional resalta mi capacidad de adaptación y aprendizaje rápido. Desde trabajar como acústico hasta convertirme en ingeniero interactivo y ahora en desarrollador de software, siempre he aceptado nuevos desafíos y tecnologías.",
    "firstTitle": "Graduado como Ingeniero Acústico",
    "firstDescription": "Trabajé en proyectos como la construcción de escuelas y estudios de música, incluida la Berklee Music Lab School en Quito, Ecuador.",
    "firstImageDescription": "Estudio musical de Music Lab el cual ayudé a construir.",
    "secondTitle": "Introducción al Mundo Tecnológico",
    "secondDescription": "Contratado para participar en la construcción de la exposición Zoom en el Museo del Agua Yaku en Ecuador. Diseñé altavoces especiales y programé un sistema interactivo utilizando Raspberry Pi.",
    "secondImageDescription": "Exposición de museo para la que diseñé los altavoces tipo cúpula y desarrollé la interactividad.",
    "thirdTitle": "Desarrollador de Sistemas Interactivos",
    "thirdDescription": "Desarrollé sistemas interactivos para museos utilizando Raspberrys y Arduinos. Empezó mi pasión por la tecnología y la programación.",
    "thirdImageDescription": "Proyector táctil que instalé en la exposición 'Intangibles' de Fundación Telefónica en Quito, Ecuador.",
    "fourthTitle": "Transición al Desarollo Web",
    "fourthDescription": "Durante la pandemia, decidí pasarme al desarrollo web. Asistí a un curso intensivo de 4 meses de Full Stack (MERN) en el cual desarrollé un fuerte fundamento de programación que he seguido puliendo desde entonces.",
    "fourthImageDescription": "La primera de todas mis certificaciones en desarrollo web.",
    "fifthTitle": "Desarrollador Frontend en Jelou",
    "fifthDescription": "Un mes después de terminar el curso, me contrataron como desarrollador frontend en Jelou. Mi camino en el desarrollo web comenzó!",
    "fifthImageDescription": "Mi primera experiencia profesional como desarrollador Frontend.",
    "sixthTitle": "Desarrollador Full Stack en Twilio",
    "sixthDescription": "Luego de mi tiempo en Jelou, fui contratado como desarrollador remoto Full Stack para trabajar en el sitio web de Twilo, como consultor de Stackbuilders.",
    "sixthImageDescription": "Participé en la construcción del nuevo sitio de documentación de Twilio. Este es un ejemplo de las nuevas páginas, que contienen componentes como muestras de codigo generados dinámicamente."
  },
  "Navigation": {
    "home": "Inicio",
    "portfolio": "Portafolio",
    "aboutMe": "Sobre mí"
  },
  "LocaleSwitcher": {
    "label": "Cambiar lenguaje",
    "locale": "{locale, select, en {🇺🇸 Inglés} es {🇪🇸 Español} other {Unknown}}"
  }
}
