{
  "HomePage": {
    "presentation": "Desarrollador Web",
    "description": "춰Bienvenidos! Soy un desarrollador web con m치s de dos a침os de experiencia profesional colaborando en equipos 치giles. Mi experiencia se centra en la creaci칩n de aplicaciones web din치micas utilizando React y TypeScript, con un fuerte enfoque en el rendimiento, la accesibilidad y la experiencia del usuario.",
    "mainSkills": "Habilidades principales"
  },
  "Portfolio": {
    "projectsTitle": "Proyectos",
    "experienceTitle": "Experiencia Profesional",
    "newsTitle": "Noticias del Espacio",
    "newsDescription": "Una aplicaci칩n web que ofrece las 칰ltimas noticias relacionadas con el espacio, creada con un frontend y backend de Next.js. La aplicaci칩n aprovecha una base de datos MongoDB y utiliza un cron job de Vercel para actualizar autom치ticamente el contenido de las noticias dos veces al d칤a mediante el uso de la API de noticias.",
    "sttoriaTitle": "Landing Page de Sttoria",
    "SttoriaDescription": "Elegante landing page para el Estudio de Fotograf칤a Sttoria, con una galer칤a de im치genes estilo bento para mostrar sus servicios y un reproductor de video minimalista para una presentaci칩n limpia y profesional.",
    "tasksTitle": "Administrador de Tareas Estilo Kanban",
    "taskManagerDescription": "Una robusta aplicaci칩n de gesti칩n de tareas que cuenta con un dise침o de tablero Kanban que admite operaciones CRUD, filtrado avanzado, paginaci칩n y autenticaci칩n de Google para el acceso de los usuarios.",
    "dashboardTitle": "Dashboard de Facturas (Migraci칩n a Prisma)",
    "dashboardDescription": "Como parte de un curso de Next.js, desarroll칠 un panel de control que se basa en las 칰ltimas caracter칤sticas de Next.js. La implementaci칩n inicial utiliz칩 la biblioteca @vercel/postgres para consultas de bases de datos. Sin embargo, me propuse ir m치s all치 del material del curso e integr칠 con 칠xito Prisma (@prisma/client) como reemplazo. Esta migraci칩n fue una experiencia enriquecedora para mejorar la gesti칩n de bases de datos con las capacidades de consulta m치s avanzadas de Prisma.",
    "twilioTitle": "Desarrollador Full Stack en Twilio (2 a침os)",
    "twilioDescription": "Como consultor, contribu칤 a la migraci칩n exitosa de un sitio de documentaci칩n de Django a Next.js. Desarroll칠 nuevos componentes de React, siguiendo las mejores pr치cticas en desarrollo basado en pruebas (TDD), optimizaci칩n SEO, accesibilidad y rendimiento. Adem치s, dirig칤 el proceso de control de calidad (QA), asegur치ndome de que las p치ginas reci칠n desarrolladas funcionaran correctamente y cumplieran con altos est치ndares.",
    "jelouTitle": "Desarrollador Frontend en Jelou (2 meses)",
    "jelouDescription": "Implement칠 soporte para cargar elementos, incluidos archivos PDF y multimedia, dentro del formulario de entrada de plantilla HSM (mensaje de alta estructura). Adem치s, integr칠 el nuevo dise침o de la p치gina de destino en un marco Next.js, lo que garantiz칩 una funcionalidad perfecta y la alineaci칩n con las especificaciones de dise침o.",
    "nidoTitle": "Ingeniero en Nido Interactive (2 a침os)",
    "nidoDescription": "Como ingeniero de interactividad, me especializo en dar vida a instalaciones interactivas mediante la programaci칩n de sistemas integrados como Raspberry Pi y Arduino. Con experiencia en el montaje y soldadura de circuitos personalizados y la integraci칩n de diversos sensores, creo entornos din치micos y receptivos.",
    "viewProject": "Ver proyecto",
    "seeDescription": "Mostrar descripci칩n",
    "hideDescription": "Ocultar descripci칩n"
  },
  "Navigation": {
    "home": "Inicio",
    "portfolio": "Portafolio",
    "certifications": "Certificaciones"
  },
  "LocaleSwitcher": {
    "label": "Cambiar lenguaje",
    "locale": "{locale, select, en {游쥟릖 Ingl칠s} es {游쀯릖 Espa침ol} other {Unknown}}"
  }
}
